var id = 'dot-map-hou-han-shu';
var title = '后汉书列女分布点图';
var data = [
  { name: '勃海', value: [116.8507, 38.305458] },
  { name: '太原', value: [112.5586, 37.87266] },
  { name: '广汉', value: [104.3378, 31.10741] },
  { name: '沛郡', value: [116.7729, 33.91372] },
  { name: '扶风', value: [107.9081, 34.379318] },
  { name: '河南', value: [113.688, 34.789502] },
  { name: '漢中', value: [107.03519, 33.07648] },
  { name: '会稽', value: [120.8704, 30.040995] },
  { name: '吴', value: [120.6482, 31.25484] },
  { name: '汝南', value: [114.0221, 33.014209] },
  { name: '汝南', value: [114.0221, 33.014209] },
  { name: '酒泉', value: [98.50011, 39.738247] },
  { name: '沛', value: [116.7729, 33.91372] },
  { name: '安定', value: [107.2098, 35.674552] },
  { name: '潁川', value: [113.8395, 34.037364] },
  { name: '犍为', value: [103.9543, 29.209427] },
  { name: '犍为', value: [103.9543, 29.209427] },
  { name: '陈留', value: [114.3174, 34.802175] }
];

render_dot_map(id, title, data);