var id = 'dot-map-jin-shu';
var title = '晋书列女分布点图';
var data = [
  { name: '陇西', value: [104.63505, 35.010906] },
  { name: '京兆', value: [104.63505, 35.010906] },
  { name: '颍川', value: [113.84697, 34.037364] },
  { name: '薛', value: [117.17199, 35.123105] },
  { name: '豫章', value: [115.93127, 28.62378] },
  { name: '陇西', value: [115.93127, 28.62378] },
  { name: '吴郡', value: [119.96138, 30.055974] },
  { name: '汝南', value: [114.35733, 33.00757] },
  { name: '长沙', value: [112.93973, 28.22496] },
  { name: '太康', value: [114.84725, 34.069799] },
  { name: '西道', value: [111.46111, 30.362718] },
  { name: '陕县', value: [111.11562, 34.718908] },
  { name: '始平', value: [108.49122, 34.298559] },
  { name: '弘农', value: [110.81877, 34.536228] },
  { name: '天水', value: [105.73256, 34.580517] }
];

render_dot_map(id, title, data);