var id = 'dot-map-jin';
var title = '金史列女点图';
var data = [
  { name: '金源', value: [126.740974, 45.811441] },
  { name: '鄜州', value: [109.386694, 35.999762] },
  { name: '同州', value: [109.941554, 34.80539] },
  { name: '潍州', value: [119.162629, 36.712883] },
  { name: '莱州', value: [119.943419, 37.186547] },
  { name: '中京', value: [116.367966, 39.92487] },
  { name: '定海', value: [121.711716, 29.953701] },
  { name: '洛川', value: [109.420007, 35.770408] },
  { name: '鄜州', value: [109.386694, 35.999762] },
  { name: '临洮', value: [103.861577, 35.399881] },
  { name: '秦州', value: [105.727968, 34.584797] },
  { name: '金源', value: [126.740974, 45.811441] },
  { name: '许州', value: [113.835479, 34.03162] },
  { name: '许州', value: [113.835479, 34.03162] }
];

render_dot_map(id, title, data);