var id = 'dot-map-liang-tang';
var title = '两唐书列女分布点图'
var data = [
  { name: '梓州', value: [105.0876, 31.09462] },
  { name: '定州', value: [114.975044, 38.520061] },
  { name: '京兆', value: [108.907, 34.24642] },
  { name: '蒲州', value: [110.551643, 35.097809] },
  { name: '绛州', value: [111.216148, 35.616409] },
  { name: '范阳', value: [115.979895, 39.484606] },
  { name: '滑州', value: [114.6254, 35.62207] },
  { name: '皖城', value: [116.841767, 30.742131] },
  { name: '下邳', value: [117.886884, 34.118265] },
  { name: '华州', value: [109.7598877, 34.51962662] },
  { name: '濮州', value: [115.5035629, 35.67287064] },
  { name: '深州', value: [115.582257, 37.869494] },
  { name: '扬州', value: [119.437187, 32.39127] },
  { name: '汴', value: [114.351388, 34.816401] },
  { name: '淄州', value: [117.960956, 36.635994] },
  { name: '饶州', value: [116.663833, 28.994167] },
  { name: '京兆', value: [108.907, 34.24642] },
  { name: '京兆', value: [108.907, 34.24642] },
  { name: '秦州', value: [105.33464, 34.742191] },
  { name: '汴州', value: [114.351388, 34.816401] },
  { name: '安南', value: [105.8382, 21.0274] },
  { name: '平洲', value: [118.89144, 39.902608] },
  { name: '卫州', value: [114.0703, 35.41038] },
  { name: '滑州', value: [114.6254, 35.62207] },
  { name: '青州', value: [118.4878, 36.6869] },
  { name: '瀛州', value: [116.085533, 38.435699] },
  { name: '蔡', value: [114.366534, 33.009992] },
  { name: '徐州', value: [117.1876831, 34.26963425] },
  { name: '洪州', value: [115.935879, 28.656243] },
  { name: '抚州', value: [116.351341, 27.984781] },
  { name: '兗州', value: [116.80956, 35.591989] },
  { name: '河南', value: [112.5859222, 34.72785568] }
];

render_dot_map(id, title, data);